#include<iostream>
#include<vector>
#include"header.h"
using namespace std;

//Task1
//Implement a function that takes a vector of integers and returns a new vector, 
//containing only prime numbers from the original vector.

//Task2
//Write a program that asks the user for the size of a vector
//and then fills it with random numbers from 1 to 100.
//Sort the vector in descending order and display the sorted vector on the screen.

//Task3
//Реализуйте функцию, которая принимает два вектора целых чисел и возвращает новый вектор,
//содержащий элементы, которые присутствуют только в одном из векторов(исключая общие элементы).

int main()
{
	//vector <int> num{0, 1, 1, 2, 3, 4, 5, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 15, 16, 18, 19, 19, 20};
	//task1(num);

	/*int size = 0;
	cout << "Enter size of array: ";
	size = checkV();
	task2(size);*/


	return 0;
}